# Proximity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceWithContext..::..Proximity Property
ReferenceWithContext Class See Also
---
The proximity value to the ray's origin when the reference is returned by FindReferencesWithContextByDirection(XYZ, XYZ, View3D) or ReferenceIntersector.Find(XYZ, XYZ).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Proximity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Proximity As Double
	Get
```

Visual C++
---
```text
public:
property double Proximity {
	double get ();
}
```

# See Also
ReferenceWithContext Class
Autodesk.Revit.DB Namespace